{
  "updatedAt": "2026-02-10 05:06 UTC",
  "tldr": [
    "Processed on-demand NOTE link and executed transcript extraction pipeline.",
    "YouTube captions are disabled for this video, so transcript fetch failed and an error artifact was saved.",
    "Reader entry was still published with metadata, jump links, and structured placeholders for follow-up notes.",
    "If you share a transcript source/file, I can auto-generate full deep notes and replace placeholders."
  ],
  "episodes": [
    {
      "show": "On-demand NOTE",
      "title": "The AI Opportunity that goes beyond Models",
      "episodeUrl": "https://youtu.be/3XVDtPU8xKE?si=4T6Nye_5lA7euQ6m",
      "youtubeUrl": "https://www.youtube.com/watch?v=3XVDtPU8xKE",
      "transcriptUrl": "/transcripts/3XVDtPU8xKE.error.json",
      "transcriptStatus": "failed",
      "notes": "Pipeline run summary:\n- Ran transcript fetch via `youtube-transcript` library.\n- Result: \"Transcript is disabled on this video\".\n- Error artifact: `/public/transcripts/3XVDtPU8xKE.error.json`.\n\nNext best path to produce full notes/transcript on reader:\n1) Provide alternate transcript source (manual captions, platform transcript, or uploaded text).\n2) I will generate structured deep notes (claims, frameworks, experiments, counterpoints) and publish updated run JSON.\n\nCurrent placeholder insights from title-level context (low-confidence):\n- Discussion likely centers on AI value capture beyond base models (distribution, workflow integration, reliability).\n- Practical advantage likely shifts to productized delivery + trust architecture.\n- GTM + outcome instrumentation likely matter more than model novelty.",
      "highlights": [
        {
          "label": "Opening context",
          "sec": 30
        },
        {
          "label": "Core argument (beyond models)",
          "sec": 300
        },
        {
          "label": "Execution implications",
          "sec": 900
        }
      ]
    }
  ],
  "rabbitHoles": [
    "Which non-model layers (distribution, data loops, UX, trust) create durable advantage here?",
    "What evidence separates narrative from deployable product strategy?",
    "How should we map these insights to micro-module monetization experiments?"
  ]
}